alexandrumot/ARGUS-SAMD21G18-Arduino/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Argus Watcher (Native USB Port)
# --------------------------------------
argus_watcher.name=Argus Watcher (Native USB Port)
argus_watcher.vid.0=0x1366
argus_watcher.pid.0=0x0105
argus_watcher.vid.1=0x2341
argus_watcher.pid.1=0x004d
argus_watcher.vid.2=0x2341
argus_watcher.pid.2=0x824d
argus_watcher.vid.3=0x2341
argus_watcher.pid.3=0x024d
argus_watcher.upload_port.0.vid=0x2341
argus_watcher.upload_port.0.pid=0x804d
argus_watcher.upload_port.1.vid=0x2341
argus_watcher.upload_port.1.pid=0x004d
argus_watcher.upload_port.2.vid=0x2341
argus_watcher.upload_port.2.pid=0x824d
argus_watcher.upload_port.3.vid=0x2341
argus_watcher.upload_port.3.pid=0x024d
argus_watcher.upload_port.4.board=argus_watcher

argus_watcher.upload.tool=bossac
argus_watcher.upload.tool.default=bossac
argus_watcher.upload.tool.network=arduino_ota
argus_watcher.upload.protocol=sam-ba
argus_watcher.upload.maximum_size=262144
argus_watcher.upload.maximum_data_size=32768
argus_watcher.upload.use_1200bps_touch=true
argus_watcher.upload.wait_for_upload_port=true
argus_watcher.upload.native_usb=true
argus_watcher.build.mcu=cortex-m0plus
argus_watcher.build.f_cpu=48000000L
argus_watcher.build.usb_product="Arduino Zero"
argus_watcher.build.usb_manufacturer="Arduino LLC"
argus_watcher.build.board=SAMD_ZERO
argus_watcher.build.core=arduino
argus_watcher.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
argus_watcher.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
argus_watcher.build.openocdscript=openocd_scripts/arduino_zero.cfg
argus_watcher.build.variant=arduino_zero
argus_watcher.build.variant_system_lib=
argus_watcher.build.vid=0x1366
argus_watcher.build.pid=0x0105
argus_watcher.bootloader.tool=openocd
argus_watcher.bootloader.tool.default=openocd
argus_watcher.bootloader.file=zero/samd21_sam_ba.bin

# Argus Logger (Native USB Port)
# --------------------------------------
# argus_logger.name=Argus Logger (Native USB Port)
# argus_logger.vid.0=0x2341
# argus_logger.pid.0=0x804d
# argus_logger.vid.1=0x2341
# argus_logger.pid.1=0x004d
# argus_logger.vid.2=0x2341
# argus_logger.pid.2=0x824d
# argus_logger.vid.3=0x2341
# argus_logger.pid.3=0x024d
# argus_logger.upload_port.0.vid=0x2341
# argus_logger.upload_port.0.pid=0x804d
# argus_logger.upload_port.1.vid=0x2341
# argus_logger.upload_port.1.pid=0x004d
# argus_logger.upload_port.2.vid=0x2341
# argus_logger.upload_port.2.pid=0x824d
# argus_logger.upload_port.3.vid=0x2341
# argus_logger.upload_port.3.pid=0x024d
# argus_logger.upload_port.4.board=argus_logger
# 
# argus_logger.upload.tool=bossac
# argus_logger.upload.tool.default=bossac
# argus_logger.upload.tool.network=arduino_ota
# argus_logger.upload.protocol=sam-ba
# argus_logger.upload.maximum_size=262144
# argus_logger.upload.maximum_data_size=32768
# argus_logger.upload.use_1200bps_touch=true
# argus_logger.upload.wait_for_upload_port=true
# argus_logger.upload.native_usb=true
# argus_logger.build.mcu=cortex-m0plus
# argus_logger.build.f_cpu=48000000L
# argus_logger.build.usb_product="Arduino Zero"
# argus_logger.build.usb_manufacturer="Arduino LLC"
# argus_logger.build.board=SAMD_ZERO
# argus_logger.build.core=arduino
# argus_logger.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
# argus_logger.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
# argus_logger.build.openocdscript=openocd_scripts/arduino_zero.cfg
# argus_logger.build.variant=arduino_zero
# argus_logger.build.variant_system_lib=
# argus_logger.build.vid=0x2341
# argus_logger.build.pid=0x804d
# argus_logger.bootloader.tool=openocd
# argus_logger.bootloader.tool.default=openocd
# argus_logger.bootloader.file=zero/samd21_sam_ba.bin